{"model_name": "RNN", "layers_config": {"config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20]}}, {"class_name": "Embedding", "config": {"input_dim": 102, "output_dim": 32}}, {"class_name": "LSTM", "config": {"units": 32, "activation": "tanh", "recurrent_activation": "sigmoid"}}, {"class_name": "Dense", "config": {"units": 102, "activation": "linear"}}]}}, "vocabulary": ["\n", " ", "!", "\"", "%", "&", "'", "(", ")", "*", "+", ",", "-", ".", "/", "0", "1", "2", "3", "4", "5", "6", "7", "9", ":", ";", "<", ">", "?", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "\\", "_", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "~", "\u00e9", "\u2019", "\u201c", "\u201d", "\u2026", "\u6e58", "\u7559", "\uff09", "\uff1a", "\ud83d\ude00", "\ud83d\ude02", "\ud83d\ude06", "\ud83d\ude09", "\ud83d\ude10", "\ud83d\ude1b", "\ud83d\ude1e", "\ud83d\ude42", "[UNK]"], "weight_b64": 