{"model_name": "RNN", "layers_config": {"config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20]}}, {"class_name": "Embedding", "config": {"input_dim": 93, "output_dim": 32}}, {"class_name": "LSTM", "config": {"units": 32, "activation": "tanh", "recurrent_activation": "sigmoid"}}, {"class_name": "Dense", "config": {"units": 93, "activation": "linear"}}]}}, "vocabulary": ["\n", " ", "!", "\"", "%", "&", "'", "(", ")", "*", ",", "-", ".", "/", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", ";", ">", "?", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "\\", "]", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "|", "~", "\u2014", "\u2018", "\u2019", "\u201c", "\u201d", "\u2022", "\u25a0", "\u25a1", "[UNK]"], "weight_b64": 