{"model_name": "RNN", "layers_config": {"config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20]}}, {"class_name": "Embedding", "config": {"input_dim": 128, "output_dim": 32}}, {"class_name": "LSTM", "config": {"units": 32, "activation": "tanh", "recurrent_activation": "sigmoid"}}, {"class_name": "Dense", "config": {"units": 128, "activation": "linear"}}]}}, "vocabulary": ["\t", "\n", "\r", " ", "!", "\"", "#", "$", "%", "&", "'", "(", ")", "*", "+", ",", "-", ".", "/", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", ";", "<", "=", ">", "?", "@", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "[", "\\", "]", "^", "_", "`", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "{", "|", "}", "\u00a0", "\u00a3", "\u00b0", "\u00bd", "\u00c4", "\u00c6", "\u00c9", "\u00e0", "\u00e2", "\u00e4", "\u00e6", "\u00e7", "\u00e8", "\u00e9", "\u00ea", "\u00eb", "\u00ee", "\u00ef", "\u00f1", "\u00f4", "\u00f6", "\u00fc", "\u0101", "\u0153", "\u2014", "\u2018", "\u2019", "\u201c", "\u201d", "\u2026", "[UNK]"], "weight_b64": 